---
kind: method
id: M:Autodesk.Revit.DB.TriangleInShellComponent.#ctor(Autodesk.Revit.DB.TriangleInShellComponent)
source: html/e47b86fa-d8af-7213-e502-870ca65d04d8.htm
---
# Autodesk.Revit.DB.TriangleInShellComponent.#ctor Method

Creates a copy of the given TriangleInShellComponent

## Syntax (C#)
```csharp
public TriangleInShellComponent(
	TriangleInShellComponent other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.TriangleInShellComponent`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null